import streamlit as st
import pandas as pd
import csv
from posters_info import posters_info
import os
import sqlite3

# BASE_DIR = os.path.dirname(os.path.abspath(__file__))
# CSV_FILE_PATH = os.path.join(BASE_DIR, 'messages.csv')

# def save_to_csv(message):
#     with open(CSV_FILE_PATH, 'a', newline='') as file:
#         writer = csv.writer(file)
#         writer.writerow([message])

# Connect to SQLite database
# conn = sqlite3.connect('messages.db')
# cursor = conn.cursor()

# # Create messages table if not exists
# cursor.execute('''
#     CREATE TABLE IF NOT EXISTS messages (
#         id INTEGER PRIMARY KEY AUTOINCREMENT,
#         message TEXT
#     )
# ''')

# def save_to_database(message):
#     cursor.execute('INSERT INTO messages (message) VALUES (?)', (message,))
#     conn.commit()

# def save_to_csv(message):
#     with open('messages.csv', 'a', newline='') as file:
#         writer = csv.writer(file)
#         writer.writerow([message])

def save_to_csv(message):
    file_path = 'messages.csv'  # Assuming messages.csv is the filename
    with open(file_path, 'a', newline='') as file:
        writer = csv.writer(file)
        writer.writerow([message])
    st.write("File saved at:", file_path)  # Log file path


# Main Page
def main_page():
    st.write("<h2 style='text-align: center; font-size: 36px; color: orange;'>Սովետական շրջանի արդյունաբերականցման պաստառներ</h2>", 
             unsafe_allow_html=True)


    st.write("""
Բարի գալուստ Սովետական շրջանի պաստառների թվային արխիվ: Կայքը նվիրված է Սովետական ​​արդյունաբերականացման պատմությունը 
             պաստառների միջոցով ուսումնասիրելուն: Մեր կայքի նպատակը օգտատերերին ծանոթացնելն է Խորհրդային 
             Միության արագ արդյունաբերական աճի դարաշրջանի և քարոզչական արվեստում դրա ներկայացվածությանը:

Արդյունաբերության ժամանակաշրջանի մասին:

20-րդ դարի սկզբից մինչև կեսերը Խորհրդային Միությունը ագրարային հասարակությունից
վերածվեց արդյունաբերական հզոր պետության: Այս շրջանը, որը նշանավորվեց արագ ուրբանիզացմամբ, տեխնոլոգիական առաջընթացով
և սոցիալական վերելքներով, անջնջելի հետք թողեց Խորհրդային հասարակության և մշակույթի վրա:

Կապ մեզ հետ:

Մենք գնահատում ենք ձեր կարծիքն ու ներդրումը: Եթե ​​ունեք հարցեր, առաջարկներ կամ ցանկանում եք նպաստել մեր նախագծին, խնդրում ենք դիմել մեզ: 
             Դուք կարող եք կապվել մեզ հետ էլ.փոստի միջոցով նամակ ուղարկելով նշված էլ. փոստերից որևէ մեկին, կամ կարող եք ձեր նամակը թողել կայքի ներքևի պատուհանում :

""")
    # st.write("Introduction of the website and its purpose")
    # st.write("A brief description of the period of industrialization in the Soviet Union")
    st.image("mainpage.jpg", width=700)

        # Contact form
    with st.form(key='contact_form'):
        # Contact information
        st.subheader("Կոնտակտային ինֆորմացիա")
        st.markdown("- Email: anna_shaljyan@edu.aua.am")
        st.markdown("- Email: hovhannes_martirosyan@edu.aua.am")
        st.markdown("- Email: sergey_tovmasyan@edu.aua.am")
        message = st.text_area("Դուք կարող եք կապ հաստատել մեզ հետ՝ թողնելով նամակ ներքևի պատուհանում:")
        submit_button = st.form_submit_button("Ուղարկել նամակը")
    
    if submit_button:
        # Save to CSV file
        save_to_csv(message)  # No email provided
        st.success("Message saved successfully!")

    # # Visualization: Number of posters over the years
    # posters_per_year = posters_df["year"].value_counts().sort_index()
    # st.write("Number of posters over the years:")
    # st.line_chart(posters_per_year)

# Schedule Page
def schedule_page():
    st.title("Ժամանակացույց")

    
    st.write("""
    Բացահայտեք խորհրդային արդյունաբերականացման ժամանակագրական առաջընթացը պաստառների միջոցով: 
    Սեղմեք յուրաքանչյուր տասնամյակի վրա՝ դիտելու այդ դարաշրջանի պաստառների ընտրված ընտրությունը:

1920-ական թվականներ 
- 1920-ականները հիմք դրեցին խորհրդային արդյունաբերականացմանը, որը նշանավորվեց նոր տնտեսական քաղաքականությամբ և կոլեկտիվացման սկզբնական փուլերով։ 
- Այս տասնամյակի պաստառները հաճախ ընդգծում էին հեղափոխական եռանդը և արդյունաբերական հասարակություն անցումը:
             
1930-ական թվականներ - Առաջին հնգամյա պլան
- Առաջին հնգամյա պլանը (1928-1932 թթ.) սովետական ​​արդյունաբերականացումը նոր բարձունքների հասցրեց՝ կենտրոնանալով արդյունաբերական արագ աճի և ծանր արդյունաբերության զարգացման վրա։ 
- 1930-ականների պաստառները արտացոլում են լավատեսությունն ու ոգևորությունը այս հավակնոտ տնտեսական նախաձեռնությունների շուրջ:

1940-ական թվականներ - Երկրորդ համաշխարհային պատերազմ
- 1940-ականները բնորոշվեցին Երկրորդ համաշխարհային պատերազմի բուռն իրադարձություններով, որոնց ընթացքում Խորհրդային Միությունը առանցքային դեր խաղաց ֆաշիստական ​​Գերմանիային հաղթելու գործում:
- Այս դարաշրջանի պաստառները ցուցադրում են հայրենասիրության, զոհաբերության և խորհրդային ժողովրդի հերոսական ջանքերի թեմաները:

1950-ական թվականներ - Հետպատերազմյան վերակառուցում
- Երկրորդ համաշխարհային պատերազմի ավարտից հետո Խորհրդային Միությունը սկսեց հետպատերազմյան վերակառուցման և տնտեսության վերականգնման շրջանը։ 
- 1950-ականների պաստառները խթանում են սոցիալիզմի նվաճումները և խորհրդային արդյունաբերության վերակառուցումը։

1960-ականներ - Խրուշչովի ժամանակաշրջան
- 1960-ականներին Նիկիտա Խրուշչովի գլխավորությամբ Խորհրդային Միությունը արդյունաբերականացման շարունակությունը տեսավ: 
- Այս շրջանի պաստառները արտացոլում են «Հալոցքի» ժամանակաշրջանի լավատեսությունը և տեխնոլոգիական առաջընթացի և սպառողական ապրանքների վրա շեշտադրումը:

1970-ականներ - Բրեժնևյան ժամանակաշրջան
- Բրեժնևյան ժամանակաշրջանին բնորոշ էր լճացումը և տնտեսական աճի տեմպերի դանդաղումը։ 
- 1970-ականների պաստառները հաճախ կենտրոնանում են կայունության և սոցիալիզմի ձեռքբերումների վրա, թեև աճող հիասթափության ֆոնին:

""")
    # st.write("Chronological representation of the period of industrialization")
    # st.write("Divided between decades to help show industrialization evolution")

    posters_data = {
        "image": [
    "poster1_1920_mshakuyt.jpg",
    "poster2_1920_mshakuyt.jpg",
    "poster3_1920_kens.jpg",
    "poster4_1940_kanancdery.jpg",
    "poster54_1926_kanancdery.jpg",
    "poster55_1937_kanancdery.jpg",
    "poster56_1927_kanancdery.jpg",
    "poster57_1918_kanancdery.jpg",
    "poster58_1937_kanancdery.jpg",
    "poster59_1920_kanancdery.jpg",
    "poster60_1937_kanancdery.jpg",
    "poster61_1946_kanancdery.jpg",
    "poster62_1927_kanancdery.jpg",
    "poster63_1929_kanancdery.jpg",
    "poster64_1931_kanancdery.jpg",
    "poster65_1930_kanancdery.jpg",
    "poster66_1932_kanancdery.jpg",
    "poster67_1921_kanancdery.jpg",
    "poster68_1931_kanancdery.jpg",
    "poster69_1946_kanancdery.jpg",
    "poster70_1921_kanancdery.jpg",
    "poster71_1933_kanancdery.jpg",
    "poster72_1923_kanancdery.jpg",
    "poster73_1939_kanancdery.jpg",
    "poster74_1926_kanancdery.jpg",
    "poster75_1941_kanancdery.jpg",
    "poster76_1923_gyuxatntesutyun.jpg",
    "poster77_1930_gyuxatntesutyun.jpg",
    "poster78_1920_gyuxatntesutyun.jpg",
    "poster79_1930_gyuxatntesutyun.jpg",
    "poster80_1941_gyuxatntesutyun.jpg",
    "poster81_1930_gyuxatntesutyun.jpg",
    "poster82_1931_gyuxatntesutyun.jpg",
    "poster83_1929_gyuxatntesutyun.jpg",
    "poster84_1932_gyuxatntesutyun.jpg",
    "poster85_1945_gyuxatntesutyun.jpg",
    "poster86_1930_gyuxatntesutyun.jpg",
    "poster87_1937_gyuxatntesutyun.jpg",
    "poster88_1931_gyuxatntesutyun.jpg",
    "poster89_1955_gyuxatntesutyun.jpg",
    "poster90_1945_gyuxatntesutyun.jpg",
    "poster5_1920_gyuxatntesutyun.jpg",
    "poster150_1932_tex.jpeg",
    "poster151_1950_gorc.jpeg",
    "poster152_1927_kanayq.jpeg",
    "poster153_1934_tex.jpeg",
    "poster154_1927_kanayq.jpeg",
    "poster155_1928_kens.jpeg",
    "poster156_1935_tex.jpeg",
    "poster157_1933_gorcaran.jpeg",
    "poster158_1928_gorcaran.jpeg",
    "poster159_1931_ashxatanqayin.jpeg",
    "poster160_1927_kens.jpeg",
    "poster161_1931_artadrutyun.jpeg",
    "poster162_1931_gorc.jpeg",
    "poster163_1931_ashxatanq.jpeg",
    "poster164_1937_ashxatanq.jpeg",
    "poster164_1931_kens.jpeg",
    "poster165_1930_artadrutyun.jpeg",
    "poster166_1931_kanayq.jpeg",
    "poster167_1927_artadrutyun.jpeg",
    "poster6_1920_qar.jpg",
    "poster7_1922_ashx.jpg",
    "poster8_1932_tex.jpg",
    "poster9_1927_qar.jpg",
    "poster10_1931_mshakuyt.jpg",
    "poster11_1920_qar.jpg",
    "poster12_1919_qar.jpg",
    "poster13_1921_qar.jpg",
    "poster14_1920_qar.jpg",
    "poster15_1920_qar.jpg",
    "poster16_1920_kens.jpg",
    "poster17_1951_qar.jpg",
    "poster18_1919_qar.jpeg",
    "poster19_1920_kens.jpg",
    "poster20_1937_qar.jpg",
    "poster21_1930_qar.jpg",
    "poster22_1920_kens.jpg",
    "poster23_1953_qar.jpg",
    "poster24_1927_mshakuyt.jpg",
    "poster25_1930_qar.jpg",
    "poster26_1920_qar.jpg",
    "poster27_1918_kens.jpg",
    "poster28_1946_mshakuyt.jpg",
    "poster29_1937_mshakuyt.jpg",
    "poster30_1961_qar.jpg",
    "poster31_1919_qar.jpg",
    "poster32_1935_qar.jpg",
    "poster33_1952_kens.jpg",
    "poster34_1953_qar.jpg",
    "poster35_1950_kens.jpg",
    "poster36_1954_qar.jpg",
    "poster37_1959_mshakuyt.jpg",
    "poster38_1964_mshakuyt.jpg",
    "poster39_1919_qar.jpg",
    "poster40_1948_mshakuyt.jpg",
    "poster41_1919_qar.jpg",
    "poster168_1932_kanayq.jpeg",
    "poster169_1930_ashxatanq.jpeg",
    "poster170_1930_ashxatanq.jpeg",
    "poster171_1931_tex.jpeg",
    "poster172_1932_qaroz.jpeg",
    "poster173_1931_artadrutyun.jpeg",
    "poster174_1930_ashxatanq.jpeg",
    "poster175_1931_tex.jpeg",
    "poster176_1939_qaroz.jpeg",
    "poster177_1930_qaroz.jpeg",
    "poster178_1927_qaroz.jpeg",
    "poster179_unknown_qaroz.jpeg",
    "poster180_1921_tex.jpeg",
    "poster181_1928_qaroz.jpeg",
    "poster182_unknown_qaroz.jpeg",
    "poster183_1930_qaroz.jpeg",
    "poster50_1920_kensakerp.jpg",
    "poster51_1929_ashxatanqayin.png",
    "poster52_1920_qarozchutyun.jpg",
    "poster53_1930_qarozchutyun.jpg",
    "poster91_1927_artadrutyun.jpg",
    "poster92_1928_artadrutyun.jpg",
    "poster93_1931_artadrutyun.jpg",
    "poster94_1923_artadrutyun.jpg",
    "poster95_1925_qarozchutyun.jpg",
    "poster96_1929_artadrutyun.jpg",
    "poster97_1927_artadrutyun.jpg",
    "poster98_1926_mshakuyt.jpg",
    "poster99_1926_mshakuyt.jpg",
    "poster100_1931_qar.jpg",
    "poster101_1935_kens.jpg",
    "poster102_1936_kens.jpg",
    "poster103_1963_qar.jpg",
    "poster104_1933_qar.jpg",
    "poster105_1940_gyux.jpg",
    "poster106_1926_mshakuyt.png",
    "poster107_1926_kens.png",
    "poster108_1926_qar.png",
    "poster109_1926_kens.png",
    "poster110_1922_kens.png",
    "poster111_1922_kens.png",
    "poster112_1926_kens.png",
    "poster113_1926_kens.png",
    "poster114_1922_ashx.png",
    "poster115_1922_mshakuyt.png",
    "poster116_1974_kens.png",
    "poster117_1970_kanancdery.png",
    "poster118_1965_qar.png",
    "poster119_1964_gorcaranner.png",
    "poster120_1964_qar.png",
    "poster121_1950_gyux.png",
    "poster122_1920_ashx.jpg",
    "poster123_1907_kens.png",
    "poster124_1913_kens.png",
    "poster125_1907_ashx.png",
    "poster126_1907_kanancdery.png",
    "poster127_1938_artadrutyun.jpg",
    "poster128_1936_artadrutyun.jpg",
    "poster129_1937_artadrutyun.jpg",
    "poster130_1939_kanancdery.jpg",
    "poster131_1927_mshakuyt.jpg",
    "poster132_1925_mshakuyt.jpg",
    "poster133_1920_qar.jpg",
    "poster134_1929_qar.jpg",
    "poster135_1931_gorcaranner.jpg",
    "poster136_1948_artadrutyun.jpg",
    "poster137_1948_artadrutyun.jpg",
    "poster138_1963_artadrutyun.jpg",
    "poster139_1948_artadrutyun.jpg",
    "poster140_1950_texnolog.jpg",
    "poster141_1950_artadrutyun.jpg",
    "poster142_1963_texnolog.jpg",
    "poster143_1945_kens.jpg",
    "poster144_1950_tex.jpg",
    "poster145_1920_ashxatanq.jpg",
    "poster146_1918_ashxatanq.jpg",
    "poster147_1937_texnolog.jpg",
    "poster148_1932_texnolog.jpg",
    "poster149_1930_ashxatanq.jpg",
    "poster184_1962_ashxatanq.png",
    "poster185_1937_ashxatanq.png",
    "poster186_1980_ashxatanq.png",
    "poster187_1974_ashxatanq.png",
    "poster188_1930_qaroz.png",
    "poster189_1931_ashxatanq.png",
    "poster190_1932_kanayq.png",
    "poster191_1983_ashxatanq.png",
    "poster192_1959_tex.png",
    "poster193_1984_tex.png",
    "poster194_1967_ashxatanq.png",
    "poster195_1975_qaroz.png",
    "poster196_1978_tex.png",
    "poster197_1920_gorcaranner.jpg",
    "poster198_1930_ashxatanq.jpg",
    "poster199_1920_ashxatanq.jpg",
    "poster200_1947_gyuxatnt.jpg"
],
    "year": [
        1920,
        1920,
        1920,
        1940,
        1926,
        1937,
        1927,
        1918,
        1937,
        1920,
        1937,
        1946,
        1927,
        1929,
        1931,
        1930,
        1932,
        1921,
        1931,
        1946,
        1921,
        1933,
        1923,
        1939,
        1926,
        1941,
        1923,
        1930,
        1920,
        1930,
        1941,
        1930,
        1931,
        1929,
        1932,
        1945,
        1930,
        1937,
        1931,
        1955,
        1945,
        1920,
        1932,
        1950,
        1927,
        1934,
        1927,
        1928,
        1935,
        1933,
        1928,
        1931,
        1927,
        1931,
        1931,
        1931,
        1937,
        1931,
        1930,
        1931,
        1927,
        1920,
        1922,
        1932,
        1927,
        1931,
        1920,
        1919,
        1921,
        1920,
        1920,
        1920,
        1951,
        1919,
        1920,
        1937,
        1930,
        1920,
        1953,
        1927,
        1930,
        1920,
        1918,
        1946,
        1937,
        1961,
        1919,
        1935,
        1952,
        1953,
        1950,
        1954,
        1959,
        1964,
        1919,
        1948,
        1919,
        1932,
        1930,
        1930,
        1931,
        1932,
        1931,
        1930,
        1931,
        1939,
        1930,
        1927,
        1920,
        1921,
        1928,
        1920,
        1930,
        1920,
        1929,
        1920,
        1930,
        1927,
        1928,
        1931,
        1923,
        1925,
        1929,
        1927,
        1926,
        1926,
        1931,
        1935,
        1936,
        1963,
        1933,
        1940,
        1926,
        1926,
        1926,
        1926,
        1922,
        1922,
        1926,
        1926,
        1922,
        1922,
        1974,
        1970,
        1965,
        1964,
        1964,
        1950,
        1920,
        1907,
        1913,
        1907,
        1907,
        1938,
        1936,
        1937,
        1939,
        1927,
        1925,
        1920,
        1929,
        1931,
        1948,
        1948,
        1963,
        1948,
        1950,
        1950,
        1963,
        1945,
        1950,
        1920,
        1918,
        1937,
        1932,
        1930,
        1962,
        1937,
        1980,
        1974,
        1930,
        1931,
        1932,
        1983,
        1959,
        1984,
        1967,
        1975,
        1978,
        1920,
        1930,
        1920,
        1947
    ],
        "theme": [
        "Մշակույթ",
        "Մշակույթ",
        "Կենսակերպ և հայացողություն",
        "Կանանց դերը",
        "Կանանց դերը",
        "Կանանց դերը",
        "Կանանց դերը",
        "Կանանց դերը",
        "Կանանց դերը",
        "Կանանց դերը",
        "Կանանց դերը",
        "Կանանց դերը",
        "Կանանց դերը",
        "Կանանց դերը",
        "Կանանց դերը",
        "Կանանց դերը",
        "Կանանց դերը",
        "Կանանց դերը",
        "Կանանց դերը",
        "Կանանց դերը",
        "Կանանց դերը",
        "Կանանց դերը",
        "Կանանց դերը",
        "Կանանց դերը",
        "Կանանց դերը",
        "Կանանց դերը",
        "Գյուղատնտեսական",
        "Գյուղատնտեսական",
        "Գյուղատնտեսական",
        "Գյուղատնտեսական",
        "Գյուղատնտեսական",
        "Գյուղատնտեսական",
        "Գյուղատնտեսական",
        "Գյուղատնտեսական",
        "Գյուղատնտեսական",
        "Գյուղատնտեսական",
        "Գյուղատնտեսական",
        "Գյուղատնտեսական",
        "Գյուղատնտեսական",
        "Գյուղատնտեսական",
        "Գյուղատնտեսական",
        "Գյուղատնտեսական",
        "Տեխնոլոգիական առաջընթաց",
        "Գործարաններ",
        "Կանանց դերը",
        "Տեխնոլոգիական առաջընթաց",
        "Կանանց դերը",
        "Կենսակերպ և հայացողություն",
        "Տեխնոլոգիական առաջընթաց",
        "Գործարաններ",
        "Գործարաններ",
        "Աշխատանքային",
        "Կենսակերպ և հայացողություն",
        "Արտադրություն և նոր ապրանքներ",
        "Գործարաններ",
        "Աշխատանքային",
        "Աշխատանքային",
        "Կենսակերպ և հայացողություն",
        "Արտադրություն և նոր ապրանքներ",
        "Կանանց դերը",
        "Արտադրություն և նոր ապրանքներ",
        "Քարոզչություն և Գաղափարախոսություն",
        "Աշխատանքային",
        "Տեխնոլոգիական առաջընթաց",
        "Քարոզչություն և Գաղափարախոսություն",
        "Մշակույթ",
        "Քարոզչություն և Գաղափարախոսություն",
        "Քարոզչություն և Գաղափարախոսություն",
        "Քարոզչություն և Գաղափարախոսություն",
        "Քարոզչություն և Գաղափարախոսություն",
        "Քարոզչություն և Գաղափարախոսություն",
        "Կենսակերպ և հայացողություն",
        "Քարոզչություն և Գաղափարախոսություն",
        "Քարոզչություն և Գաղափարախոսություն",
        "Կենսակերպ և հայացողություն",
        "Քարոզչություն և Գաղափարախոսություն",
        "Քարոզչություն և Գաղափարախոսություն",
        "Կենսակերպ և հայացողություն",
        "Քարոզչություն և Գաղափարախոսություն",
        "Մշակույթ",
        "Քարոզչություն և Գաղափարախոսություն",
        "Քարոզչություն և Գաղափարախոսություն",
        "Կենսակերպ և հայացողություն",
        "Մշակույթ",
        "Մշակույթ",
        "Քարոզչություն և Գաղափարախոսություն",
        "Քարոզչություն և Գաղափարախոսություն",
        "Քարոզչություն և Գաղափարախոսություն",
        "Կենսակերպ և հայացողություն",
        "Քարոզչություն և Գաղափարախոսություն",
        "Կենսակերպ և հայացողություն",
        "Քարոզչություն և Գաղափարախոսություն",
        "Մշակույթ",
        "Մշակույթ",
        "Քարոզչություն և Գաղափարախոսություն",
        "Մշակույթ",
        "Քարոզչություն և Գաղափարախոսություն",
        "Կանանց դերը",
        "Աշխատանքային",
        "Աշխատանքային",
        "Տեխնոլոգիական առաջընթաց",
        "Քարոզչություն և Գաղափարախոսություն",
        "Արտադրություն և նոր ապրանքներ",
        "Աշխատանքային",
        "Տեխնոլոգիական առաջընթաց",
        "Քարոզչություն և Գաղափարախոսություն",
        "Քարոզչություն և Գաղափարախոսություն",
        "Քարոզչություն և Գաղափարախոսություն",
        "Քարոզչություն և Գաղափարախոսություն",
        "Տեխնոլոգիական առաջընթաց",
        "Քարոզչություն և Գաղափարախոսություն",
        "Քարոզչություն և Գաղափարախոսություն",
        "Քարոզչություն և Գաղափարախոսություն",
        "Կենսակերպ և հայացողություն",
        "Աշխատանքային",
        "Քարոզչություն և Գաղափարախոսություն",
        "Քարոզչություն և Գաղափարախոսություն",
        "Արտադրություն և նոր ապրանքներ",
        "Արտադրություն և նոր ապրանքներ",
        "Արտադրություն և նոր ապրանքներ",
        "Արտադրություն և նոր ապրանքներ",
        "Քարոզչություն և Գաղափարախոսություն",
        "Արտադրություն և նոր ապրանքներ",
        "Արտադրություն և նոր ապրանքներ",
        "Մշակույթ",
        "Մշակույթ",
        "Քարոզչություն և Գաղափարախոսություն",
        "Կենսակերպ և հայացողություն",
        "Կենսակերպ և հայացողություն",
        "Քարոզչություն և Գաղափարախոսություն",
        "Քարոզչություն և Գաղափարախոսություն",
        "Գյուղատնտեսություն",
        "Մշակույթ",
        "Կենսակերպ և հայացողություն",
        "Քարոզչություն և Գաղափարախոսություն",
        "Կենսակերպ և հայացողություն",
        "Կենսակերպ և հայացողություն",
        "Կենսակերպ և հայացողություն",
        "Կենսակերպ և հայացողություն",
        "Կենսակերպ և հայացողություն",
        "Աշխատանքային",
        "Մշակույթ",
        "Կենսակերպ և հայացողություն",
        "Կանանց դերը",
        "Քարոզչություն և Գաղափարախոսություն",
        "Գործարաններ",
        "Քարոզչություն և Գաղափարախոսություն",
        "Գյուղատնտեսություն",
        "Աշխատանքային",
        "Կենսակերպ և հայացողություն",
        "Կենսակերպ և հայացողություն",
        "Աշխատանքային",
        "Կանանց դերը",
        "Արտադրություն և նոր ապրանքներ",
        "Արտադրություն և նոր ապրանքներ",
        "Արտադրություն և նոր ապրանքներ",
        "Կանանց դերը",
        "Մշակույթ",
        "Մշակույթ",
        "Քարոզչություն և Գաղափարախոսություն",
        "Քարոզչություն և Գաղափարախոսություն",
        "Գործարաններ",
        "Արտադրություն և նոր ապրանքներ",
        "Արտադրություն և նոր ապրանքներ",
        "Արտադրություն և նոր ապրանքներ",
        "Արտադրություն և նոր ապրանքներ",
        "Տեխնոլոգիական առաջընթաց",
        "Արտադրություն և նոր ապրանքներ",
        "Տեխնոլոգիական առաջընթաց",
        "Կենսակերպ և հայացողություն",
        "Տեխնոլոգիական առաջընթաց",
        "Աշխատանքային",
        "Աշխատանքային",
        "Տեխնոլոգիական առաջընթաց",
        "Տեխնոլոգիական առաջընթաց",
        "Աշխատանքային",
        "Աշխատանքային",
        "Աշխատանքային",
        "Աշխատանքային",
        "Աշխատանքային",
        "Քարոզչություն և Գաղափարախոսություն",
        "Աշխատանքային",
        "Կանանց դերը",
        "Աշխատանքային",
        "Տեխնոլոգիական առաջընթաց",
        "Տեխնոլոգիական առաջընթաց",
        "Աշխատանքային",
        "Քարոզչություն և Գաղափարախոսություն",
        "Տեխնոլոգիական առաջընթաց",
        "Գործարաններ",
        "Աշխատանքային",
        "Աշխատանքային",
        "Գյուղատնտեսություն"
    ],
    "text": [
        "Ասա ինձ, թե ինչ գրքեր ես կարդում, և ես կասեմ, թե ով ես դու:", 
        "Իվաշկան որոշեց սովորել: Հարազատները նրան նախատում էին, բայց նա վերադարձավ և հաճելի է նրան լսելը:", 
        "Առաջ... Հիմա...", 
        "Մանկապարտեզների օրինակելի աշխատանքը կօգնի սովորել, աճել, առաջադրել երիտասարդ կին աշխատողներին։", 
        "Ազատագրված կին, եկե՛ք կառուցենք սոցիալիզմը:",
        "Ողջույն, ստալինյան ժամանակաշրջանի կանանց՝ խորհրդային երկրի երջանիկ քաղաքացիներին:",
        "Խորհրդային ձեռագործ կին և համագործակցություն:",
        "Կանայք, միացե՛ք համագործակցությանը:",
        "Ողջույն, ԽՍՀՄ-ի արդար աշխատող կնոջը:",
        "Կանայք, միացե՛ք համագործակցությանը:",
        "Մենք ծնվել ենք, որպեսզի հեքիաթն իրականանա...",
        "Եղիր սպորտսմենուհի։",
        "Կեցցե հոկտեմբերը, որը ազատեց կնոջը։",
        "Վերջ խոհանոցային ստրկությունը։ Թող նոր կենցաղային կյանք սկսի:",
        "Լավագույն կին աշխատողները ուժեղացնում են բարձրագույն բրիգադը և սովորում նոր տեխնիկա՝ հարստացնելով պրոլետար սոցիալիստների շարքերը։",
        "Կանանց աշխատավորների միջազգային օր:",
        "Կին աշխատող, կին կոլեկտիվ ֆերմեր:",
        "Ազատ Ռուսաստանի բանվոր. Ամուր բռնեք կոմունիզմի դրոշից. Կանայք ամբողջ աշխարհից հետևում են ձեզ՝ կապիտալի դեմ պայքարելու համար։",
        "Աշխատավոր կանանց միջազգային օրը պրոլետարիատի մարտական ​​օրն է։",
        "Տրամադրենք որբերին մայրական սեր և հոգատարություն:",
        "«Կին աշխատողները պետք է պատասխանատվություն կրեն իրենց ազատության համար». Վ.Լենին",
        "Կոլեկտիվ կին ֆերմերը շոկային աշխատող է բերքահավաքում:",
        "Աշխատող կին, համագործակցությունը ձեզ ազատում է խոհանոցի և վառարանի ուժից։",
        "Կեցցե Ստալինի Սահմանադրությունը։ Կեցցե կանանց իրավահավասարությունը ԽՍՀՄ-ում:",
        "Լենինը և կին բանվորը։",
        "Եկե՛ք փոխարինենք նրանց:",
        "Հողագործության և արհեստագործության ցուցահանդես Մոսկվայում՝ 1923 թվականի օգոստոս և սեպտեմբեր:",
        "Երկիրը կմատակարարի հացահատիկային և հանրային սերմացուի ֆոնդերով:",
        "Ինչպե՞ս հացից բամբակ պատրաստել:",
        "Գյուղացին, կոլեկտիվացրել է գյուղը։ Գնա միացի՛ր կարմիր տրակտորիստների շարքերին։",
        "Բերքահավաք՝ ահավոր հարված թշնամուն:",
        "Հաց է գալիս։ Ջախջախիչ հարված հասցրու Կուլակին և սպեկուլյատորին, ովքեր սաբոտաժ են անում հացահատիկի հավաքման ծրագրերը:",
        "Ֆերմայի բանվորներ և երիտասարդ կոմունիստներ, աշխատեք տրակտորների վրա:",
        "Եկեք ժամանակին քաղենք։ Գյուղը ապրանքներով ու մեքենաներով ապահովենք։",
        "Եկեք ավելի շատ զիջենք: Լավ սերմը լավ բերքի խոստումն է:",
        "Ամեն ինչ արե՞լ եք լավ բերք ստանալու համար։",
        "Լավ կազմակերպված աշխատանքը կբարձրացնի բերքը։",
        "Գյուղատնտեսության լավագույն ձեռքբերումները՝ Համամիասնական գյուղատնտեսական ցուցահանդեսում:",
        "Հացը մեր ուժն է։ Միջամտողները մեր կործանիչները. Հավաքե՛ք բերքը։",
        "Ճանապարհ տվեք եգիպտացորենին։",
        "Մեր երկրին կապահովի ռեկորդային բերք.",
        "Գյուղերի և քաղաքների երիտասարդ պրոլետարներ. Միավորվե՛ք:",
        "ԽՍՀՄ-ի տեխնիկական և տնտեսական անկախության համար։",
        "Հազարավոր նոր թմբկահարների համար",
        "Աշխատող կին, եղի՛ր սոցիալիզմի կառուցման առաջին շարքերում։",
        "Գութանների երկիր էինք, տրակտորների ու կոմբինատորների կոմսություն դարձանք։",
        "Խորհրդային ձեռագործ կինը համագործակցելիս",
        "Սոցիալիզմի երկիրը պետք է լավ ճանապարհներ ունենա։",
        "Հրուշակագործները պետք է տիրապետեն արտադրությանը։",
        "Պայքար սոցիալիստական ​​ճարտարագիտության բարձրորակ երկաթի և պողպատի համար:",
        "Մեր հզորությունը արդյունաբերականացման մեջ է:",
        "Եկեք պատժենք ստախոս լավագույն աշխատողին:",
        "Մենք կառուցում ենք սոցիալիզմ:",
        "Մետաղագործություն:",
        "Թույլ տվեք բուսականացնել արհեստանոցները, գործարանները և բույսերը:",
        "Մայիսի 1-ը։ Դեպի պայքար 5-ամյա պլանի համար: Բոլշևիկյան ճանապարհի համար. ԽՍՀՄ պաշտպանության համար, հոկտեմբեր բառի համար:",
        "Ստախանովների պես աշխատելը կօգնի հասնել աշխատուժի արտադրության նոր վերելքի՝ գերազանցելով 1937 թվականի պլանը։",
        "Մետրոպոլիտենը «մարդկանց արագ և էժան երթևեկության խնդրի լուծման հիմնական միջոցն է»։",
        "Ավելի շատ մետաղ!",
        "Լավագույն կին աշխատողները ուժեղացնում են բարձրագույն բրիգադը և սովորում նոր տեխնիկա՝ հարստացնելով պրոլետար սոցիալիստների պաշարները։",
        "Սոցիալիստական ​​հասարակայնության կառուցում:",
        "Գիտելիքը կկոտրի ստրկության շղթաները։",
        "Աշխատանքային աշխարհ. Մոսկվայի աշխատանքային կորպորատիվ կենտրոնական մարմին.",
        "UNKTP Անդրկովկասյան հեռավար տեխնիկական ուսուցման համալսարան. Գրանցվեք տեխնիկական քոլեջներ և տեխնիկումներ:",
        "Չկա գիտելիք՝ չկա հաց:",
        "Վլադիմիր Մայակովսկու աշխատանքների ցուցահանդես:",
        "Անգրագետը նույնն է, ինչ կույրը: Ուր էլ նա գնա, դժբախտություններ ու աղետներ են սպասում նրան։",
        "Խորհրդային քարոզչության օր. Գիտելիք բոլորի համար",
        "Խավարից լույս. Ճակատամարտից մինչև գիրք. Վշտից երջանկություն:",
        "Գրագիտություն՝ ճանապարհ դեպի կոմունիզմ:",
        "Մեր նպատակն է կանխատեսել համաշխարհային հեղափոխությունը՝ բարձրացնելով աշխատողների մշակութային չափանիշները:",
        "Անգրագետ. Գրագետ.",
        "Պատիվ ու փառք խորհրդային ուսուցչին:",
        "Աշխատողների և գիտության միավորումը, միաձուլված իր երկաթե գրկում կփշրի բոլոր խոչընդոտները առաջընթացի ճանապարհին։",
        "Ընթերցանությունը մարդու պարտականություններից մեկն է:",
        "Կոմսոմոլն օգնում է երեխաներին լավ սովորել և լավ հանգստանալ",
        "Գրագետ, անգրագետին սովորեցրո՛ւ.",
        "Անգրագետի կյանքը. Գրագետ մարդու կյանքը.",
        "Մեր պարտականությունը լավ սովորելն է։",
        "Ազգային կրթություն. Բարձրագույն ուսումնական հաստատություններ.",
        "Անգրագետ երեխան մոր ամոթն է.",
        "Սովորելու համար երբեք ուշ չէ: Դպրոցն այժմ բաց է բոլորի համար։ Բարի գալուստ",
        "Կազմակերպենք ընթերցասրահներ։",
        "Կինո ժողովրդին. Յուրաքանչյուր շրջկենտրոնի համար կինոթատրոն:",
        "Խորհրդային Միության ժողովուրդներ, եկեք առաջնորդենք մշակույթի աշխարհը:",
        "Սիրիր գրքերը` գիտելիքի աղբյուր:",
        "Բոլորը միանում են աշխատանքային ակումբներին:",
        "Իմացեք քարտեզը այնպես, ինչպես գիտեք ձեր հինգ մատները:",
        "Դու լավագույնն էիր սովորելիս, բայց հիմա եղիր լավագույնը աշխատանքի մեջ:",
        "Պիոներներ և աշակերտներ, գրանցվեք տեխնիկական ուսումնական խմբերում:",
        "Թերթը ոչ միայն քարոզիչ ու կոլեկտիվ ագիտատոր է, այլ նաև կոլեկտիվ կազմակերպիչ։",
        "Օգնե՛ք կրտսերին։",
        "Նկարչության, երաժշտության և երգի դասերը անպայման կբարձրացնեն աշակերտների մշակութային մակարդակը:",
        "Արվեստի աշխարհը պայծառ ու հարուստ է։ Այն բաց է երեխաների համար փոքր տարիքից:",
        "Աշխատանքային ակումբը հեղափոխական մտքի կիզակետն է։",
        "Տաղանդի ճանապարհը... Հնարավորություններ տաղանդավորների համար։",
        "Քաղաքացիներ, պահպանեք պատմական հուշարձանները.",
        "Կին աշխատող, կին կոլեկտիվ ֆերմեր…",
        "Անխափան աշխատանքը մեծացնում է ազգի հարստությունը։",
        "Անխափան աշխատանքը բարձրացնում է աշխատողի մշակութային մակարդակը։",
        "Տրանսպորտի վերակառուցման համար։ Խորհրդային տրանսպորտին կտա հզոր շոգեքարշեր։",
        "Սոցիալիզմի հաղթանակը մեր երկրում ապահովված է։ Տրված է սոցիալիստական ​​տնտեսության հիմքը։",
        "Եկեք տանք 1931 թվականին կառուցվող սոցիալիզմի համար. 8 միլիոն տոննա չուգուն։",
        "Արագացված տեմպով եկեք չորս տարում ավարտենք հնգամյա պլանը:",
        "Գյուղատնտեսական մեքենաշինության հսկան։",
        "Սովետական ​​կոոպերատիվ ֆերմաների աշխատողները և տրակտորային կայանների օպերատորները…",
        "Արևմտյան բանվորներ մասնակցում են ԽՍՀՄ սոցիալիստական ​​զարգացմանը:",
        "Ամբողջ հասարակությունը պետք է վերածվի աշխատավոր մարդկանց միասնական կոոպերատիվի։",
        "Կրոնը արդյունաբերականացման թշնամին է։",
        "Ահա թե ինչպես էինք մենք հերկել առաջ՝ երկու օր ագռավի համար։ Նայեք, մեկ ժամվա ընթացքում մի կառչեք: Ես երկու օր պայքարում եմ իմ ձիու հետ հերկելու համար։",
        "Կոմսոմոլ:",
        "Իմպերիալիստների մտադրություններին լավագույն պատասխանը ԽՍՀՄ-ում արդյունաբերականացման և համագործակցության ամրապնդումն է։",
        "Հինգ տարվա հաղթական երթը իմպերիալիստները չեն կարող կանգնեցնել:",
        "Ռուսաստանում կոմունիստական հեղափոխության երրորդ տարեդարձը: Համաշխարհային իմպերիալիզմի փլուզումը:",
        "Ստալինի նոր հինգ տարվա պլանը չորս տարում:",
        "Կարմիր նվեր սպիտակ ջենթլմենին:",
        "Կրոնը թույն է, տղերք զգույշ եղեք:",
        "Սոյայի սոուս:",
        "Նրբերշիկ:",
        "Շրթներկ:",
        "Գնեք էժան հաց:",
        "Եթե ​​գրքեր չես կարդում, շուտով կմոռանաս քո գրագիտությունը։",
        "Ավտոդոռ վիճակախաղ. Տոմսի արժեքը 50 կոպեկ",
        "Ծխիր ծխախոտի տուփ. Ոչ մի այլ բրանդի, բացի Mosselprom-ից:",
        "'Զարե' կինոնկարի պաստառի էսքիզ",
        "«Զարե» ֆիլմի աֆիշի կինոպաստառի էսքիզ",
        "Բոլորս դեպի տեխնիկա ուսումնասիրող բջիջներ.",
        "Ունևոր և երջանիկ կոլտնտեսային կյանքի ուղիով",
        "«Հնգամյակը՝ չորս տարում» պաստառի էսքիզներ",
        "Պահպանենք հայրիկի պատիվը",
        "«Լենինը համաշխարհային պրոլետարիատի առաջնորդն է»",
        "«Պայքարենք Ստալինյան 7-8 միլիարդ փութ հացահատիկի համար»",
        "Երևանյան պեյզաժ. Աբովյան և Շահումյան փողոցների անկյունը. Կոոպերացիայի և մասնավոր առևտրի հարաբերությունը Հայաստանում",
        "Իննը տարի առաջ հանված լուսանկար. Ահա թե ինչ է ջնջել հեղափոխությունն իննը տարի առաջ հավիտյանս հավիտենից, ամեն:",
        "Կապիտալիստը. Ինչու նախապես չաշխատեցիր, որ այս աղմուկը չլսել կարողանայի:",
        "Գարունը Երևանում:",
        "Կրթված նորեկի արկածները:",
        "Հիվանդներին առողջները ճանապարհ են գցում: Մենք աշխարհի խորթ զավակն ենք, մեզ փայ չկա կուրորտից:",
        "Լոռու նավթը:",
        "Տնտեսման ռեժիմը և վարիչ՝ Մարուք Հովասափյանը:",
        "Եվրոպականացված Երևանը:",
        "Ամենամատչելի կուլտուրական-գեղարվեստական սնունդը:",
        "Շնորհավոր նոր ուսումնական տարի:",
        "Երիտասարդներ և աղջիկներ",
        "Աշխատանքով մենք կբարձրացնենք հերոս քաղաքի փառքը:",
        "Խնայողությամբ օգտագործիր Էլեկտրաէներգիա:",
        "Սպասում ենք քեզ շինարարությունում:",
        "Մի հետ մնա:",
        "Երեք տարվա բանվորա-գյուղացիական իշխանությունը կոմունիզմին անսասան հուշարձան դրեց:",
        "Երթևեկությունը անկանոնության պատճառներից մեկն է:",
        "Դեր. Փափազյանը ճիշտ է, թեև դժվարանում եմ այս ծանր լուծը տանել, բայց ինձ օգնում են:",
        "Մոսկովսկու գործադուլը: Այդ ֆիրմայի ինժիներները աշխատում են ձխնից սառած խողովակները «խոդ գցել»:",
        "Հրեա կամ ռուս օրիորդը: Հայ օրիորդը (մասնավորապես Բաքվի):",
        "Ժամանակն է, որ բոլորը փորձեն, թե որքան համեղ ու քնքուշ են խեցգետինները։",
        "Պելմենիներ",
        "Տաք մոսկովյան կոտլետներ բուլկիներով. 50 կոպեկ",
        "Կին, բարձրացիր լոկոմոտիվը։",
        "ԽՍՀՄ-ի արդյունաբերականացում.",
        "«Կինոյի անկյուն. Բոլոր արվեստներից, իմ կարծիքով, ամենակարեւորը կինոն է»:",
        "«Գյուղացիական հողագործությունը կբարելավի գրագիտությունը. Երեխաներին սովորեցնել ГОСИЗДАТА դասագրքերով»:",
        "Տրանսպորտի զարգացումը հնգամյա ծրագրի իրականացման կարևորագույն խնդիրներից է:",
        "Կանաչապատենք գործարաններն ու արտադրամասերը:",
        "Պաղպաղակ",
        "Վիտամին A.",
        "32 մորթու աճուրդ Լենինգրադում:",
        "Մայոնեզը լավագույն պատրաստի համեմունքն է:",
        "Խնայեք ժամանակը:",
        "Կանաչ թեյ «Վրաստանի ծաղկեփունջ».",
        "Ժամանակի շահում: Մեկ օր գնացքով, մեկ ժամ ինքնաթիռով:",
        "Հայաստանում սովետական կարգերի հաստատման 25-րդ տարեդարձի առթիվ 1945 թվականին թողարկվել է նաև այս պաստառը:",
        "Դեպի նոր առաջընթաց խորհրդային ավիացիայի մեջ:",
        "Կեցցե զինված երկաթուղայինի աշխատողը։",
        "Աշխատանքի կառավարում:",
        "Երիտասարդներ, միացե՛ք մեքենաներով և մոտոցիկլետներով սպորտին:",
        "Կոմսոմոլեց-ֆերմեր, եղիր մեքենաների նվաճման առաջնագծում:",
        "Կոլեկտիվ տնտեսություններ միացեք հարվածային բրիգադների շարքին:",
        "Դեպի աշխատանք:",
        "Փառք Սովետական Կոլտնտեսությանը:",
        "Փառք աշխատավորին:",
        "Մարդը աշխատանքով է գեղեցիկ:",
        "Մենք պահանջում ենք համընդհանուր պարտադիր կրթություն:",
        "Հասնենք հացահատիկի առատությանը:",
        "Կեցցե աշխատավոր կինը:",
        "Պարենային ծրագիրը համաժողովրդական գործ է:",
        "Երկինքը կանչում է:",
        "Աճում և զարգանում է գյուղատնտեսական համալիրը:",
        "Փառք աշխատանքին",
        "Ուսանող, ամառը սպասում է քեզ:",
        "Աշխատի՛ր",
        "Էլեկտրաէներգիա բոլորի համար:",
        "Լավ կազմակերպված աշխատանքը կբարձրացնի բերքը։",
        "Աշխատանքը կլինի աշխարհի տերը:",
        "Եթե ​​շատ աշխատես, հաց կունենաս։"
        ]
    }
    posters_df = pd.DataFrame(posters_data)

    # Add year and theme selectors
    default_year = 1900  # Set a default year within the specified range
    selected_year = st.number_input("Ընտրեք տարին:", 
                                    value=default_year, 
                                    min_value=1900, 
                                    max_value=1980)

    selected_theme = st.selectbox("Ընտրեք ենթաթեման:", ['Բոլորը', "Աշխատանքային", "Գյուղատնտեսական", "Գործարաններ", "Տեխնոլոգիական առաջընթաց", "Կենսակերպ և նոր հայացողություն", 
                  "Արտադրություն և նոր ապրանքներ", "Կանանց դերը", "Քարոզչություն և Գաղափարախոսություն", "Մշակույթ"])


    # Filter posters based on selected year and/or theme
    if selected_theme == 'Բոլորը':
        filtered_posters = posters_df[posters_df["year"] == selected_year]
    else:
        filtered_posters = posters_df[(posters_df["year"] == selected_year) & (posters_df["theme"] == selected_theme)]

    # Display filtered posters
    st.write("Պաստառներ նշված տարվա և ենթաթեմայի համար:")
    for index, row in filtered_posters.iterrows():
        st.image(row["image"], caption=row["text"], width=500)
        # st.image(row["image"])
    # Add more details about each period and subsections

# Subtopics Page
def subtopics_page():
    st.title("Ենթաթեմաներ:")
    st.write("""
Ուսումնասիրեք խորհրդային արդյունաբերականացման յուրահատկությունները հետևյալ թեմատիկ կատեգորիաների / ենթաթեմաների միջոցով.

- Աշխատողների առօրյան. 
            Պաստառներ , որոնք պատկերում են արդյունաբերական աշխատողների կյանքն ու պայքարը խորհրդային արդյունաբերականացման վաղ փուլերում:

- Տեղեկատվական պաստառներ. Քարոզչություն, որն ընդգծում է արդյունաբերության և գյուղատնտեսության ոլորտում ձեռքբերումներն ու նվաճումները, քանի որ Խորհրդային Միությունը հիմք դրեց տնտեսական վերափոխման:

- Գյուղատնտեսություն և ռացիոնալացում. Պաստառներ, որոնք ցույց են տալիս գյուղատնտեսության մեթոդների առաջընթացը և կոլեկտիվացման մղումը:

- Գործարանների ինտեգրում. Պաստառներ, որոնք ցույց են տալիս գործարանների դերը հասարակական կյանքում և աշխատողների մոբիլիզացումը արդյունաբերական նպատակներին հասնելու համար:

- Տեխնոլոգիական առաջընթացներ. Պաստառներ, որոնք ցույց են տալիս նոր սարքավորումների և տեխնոլոգիաների ներդրումը տարբեր արդյունաբերական ոլորտներում:

- Կյանքի որակի փոփոխություն. Կենսամակարդակի բարելավումն ու առօրյա կյանքի վրա արդյունաբերականացման ազդեցությունն արտացոլող պաստառներ:

- Արտադրություն և նոր ապրանքներ. Սա ընդգծում է ապրանքների զանգվածային արտադրությունը, ներառյալ տեքստիլները, սպառողական ապրանքները և արդյունաբերական նյութերը:

- Կանանց դերը. Պաստառներ, որոնք պատկերում են կանանց կարևոր դերը արդյունաբերական աշխատուժում և հասարակության մեջ:

- Քարոզչություն և Գաղափարախոսություն. Պաստառներ, որոնք քարոզում են սոցիալիստական իդեալները, խորհրդային պետության ձեռքբերումները երկրի կառուցման ու բարգավաճման գործում: Քարոզչությունները վերաբերվում են նոր կարգերի, իդեաների ու ստանդարտների առաջխաղացմանը` հիմնականում կրթության շնորհիվ:

- Մշակութային տեղաշարժեր. Գեղարվեստական արտահայտություններ, որոնք արտացոլում են գրագիտության, արվեստի, գրականության և երաժշտության փոփոխությունները: Արդյունաբերականացման հետ մեկտեղ փոխվում էին նաև մշակութային արժեքները:

""")
    # st.write("""
    # - Աշխատավորների առօրյան
    # - Աշխատանքային նվաճումները ցուցադրող տեղեկատվական պաստառներ
    # - Գյուղատնտեսություն և գյուղատնտեսական մեթոդների ռացիոնալացում, որոնք ընդգծում են այդ ոլորտի առաջընթացը
    # - Գործարանների ինտեգրում հասարակական կյանքի մեջ
    # - Նոր սարքավորումների և տեխնոլոգիաների ներդրումը, որը կօգնի պատկերել տեխնոլոգիական առաջընթացը տարբեր ոլորտներում
    # - Կյանքի որակի, կենսակերպի և հայացքների փոփոխություն
    # - Արտադրություն և նոր ապրանքներ, որը կընդգրկի ապրանքների զանգվածային արտադրությունը, ներառյալ տեքստիլները, սպառողական ապրանքները և արդյունաբերական նյութերը
    # - Կանանց դերը արդյունաբերական աշխատուժի և հասարակության մեջ
    # - Քարոզչություն և գաղափարախոսություն
    # - Մշակութային տեղաշարժերը գրագիտության, արվեստի, գրականության, երաժշտության և այլ ոլորտներում
    # """)

    # Add subsections with relevant information

# Poster Gallery Page
def poster_gallery_page():
    st.title("Պաստառների պատկերասրահ")
    st.write(""" Այստեղ կարող եք գտնել բոլոր պաստառները, համապատասխան տարեթվի և նկարագրության: Բացահայտեք խորհրդային արդյունաբերականացման ժամանակաշրջանի պաստառների տվյալների բազան: 
             Սեղմեք յուրաքանչյուր պաստառի վրա՝ այն դիտելու և ներքևում դրա նկարագրությունը կարդալու համար:""")
    # st.write("Ամբողջ բազան պաստառների՝ արդյունաբերականցման տարբեր տարիների և ենթաթեմաների շուրջ:")
    # st.write("Complete database of posters around industrialization")
    # st.image("poster1.jpg", caption = "Caption", width= 500)
    # st.image("poster2.jpg", caption = "Caption", width= 500)
    # st.image("poster3.jpg", caption = "Caption", width= 500)
    for i in range(len(posters_info["image"])):
        st.image(posters_info["image"][i], caption=posters_info["text"][i], width = 500)


    # Add interactive filters for filtering posters by years

# Quizzes and Polls Page
# Define quiz questions and answers
quiz_questions = [
    {
        "question": "Ո՞րն էր Խորհրդային Միության առաջին հնգամյա ծրագրի հիմնական շեշտադրումը:",
        "image": "",
        "options": ["ա) Գյուղատնտեսական կոլեկտիվացում", "բ) Ռազմական ընդլայնում", "գ) Արագ ինդուստրացում", "դ) Մշակութային բարեփոխումներ"],
        "correct_answer": "գ) Արագ ինդուստրացում",
        "points": 1
    },
    {
        "question": "Ինչպե՞ս էին խորհրդային պաստառները խթանում սոցիալիզմի գաղափարախոսությունը:",
        "image": "",
        "options": ["ա) Կապիտալիստական հասարակությունները որպես ուտոպիական պատկերելով", "բ) Բանվոր դասակարգի ձեռքբերումները փառաբանելով", 
                    "գ) Միապետության քարոզչությամբ", "դ) Կոմունիստական քաղաքականությունը քննադատելով"],
        "correct_answer": "բ) Բանվոր դասակարգի ձեռքբերումները փառաբանելով",
        "points": 1
    },
    {
        "question": "Ինչպե՞ս էին պաստառները պատկերում կանանց դերը խորհրդային արդյունաբերական աշխատուժում:",
        "image": "",
        "options": ["Որպես հիմնականում տնային տնտեսուհիներ", "Որպես արդյունաբերության հավասար ներդրում ունեցողներ", 
                    "Որպես տղամարդ աշխատողների ենթակա", "Որպես ավանդական արժեքների խորհրդանիշներ"],
        "correct_answer": "Որպես արդյունաբերության հավասար ներդրում ունեցողներ",
        "points": 1
    },
        {
        "question": "Նոր տնտեսական քաղաքականության (ՆԷՊ) նախագիծը առաջադրվել էր Մեծ Հայրենական պատերազմից հետո:",
        "image": "",
        "options": ["Ճիշտ", "Սխալ"],
        "correct_answer": "Սխալ",
        "points": 1
    },
        {
        "question": "Կրթությունն ու գրագիտությունը համարվում էին հիմքն ու գլխավոր շարժիչ ուժերը տնտեսությունը զարգացնելու համար:",
        "image": "",
        "options": ["ճիշտ", "սխալ"],
        "correct_answer": "ճիշտ",
        "points": 1
    },
        {
        "question": "Հետևյալ պաստառներից ո՞րը չի բնորոշում կանանց դերը արդյունաբերականացման գործընթացում:",
        "image": ["poster166_1931_kanayq.jpeg", "poster162_1931_gorc.jpeg", 
                    "poster63_1929_kanancdery.jpg", "poster154_1927_kanayq.jpeg"],
        "options": ["Առաջին պաստառը", "Երկրրորդ պաստառը", 
                    "Երրորդ պաստառը", "Չորրորդ պաստառը"],
        "correct_answer": "Երկրրորդ պաստառը",
        "points": 1
    },
            {
        "question": "Նշված պաստառներից ո՞րը մշակութային նպատակ չի հետապնդում:",
        "image": ["poster10_1931_mshakuyt.jpg", "poster105_1940_gyux.jpg", 
                    "poster28_1946_mshakuyt.jpg", "poster29_1937_mshakuyt.jpg"],
        "options": ["Առաջին-պաստառը", "Երկրրորդ-պաստառը", 
                    "Երրորդ-պաստառը", "Չորրորդ-պաստառը"],
        "correct_answer": "Երկրրորդ-պաստառը",
        "points": 1
    },
        {
        "question": "Արդյունաբերականացման քարոզչական պաստառներում հետևյալ թեմաներից ո՞րն է համարվում զարգացման հիմք:",
        "image": "",
        "options": ["սպորտը", "հզոր բանակի կառուցումը", 
                    "կրթությունը", "գյուղատնտեսությունը"],
        "correct_answer": "կրթությունը",
        "points": 1
    },
            {
        "question": "Արդյունաբերության ո՞ր հատվածն է զգալի ներդրումներ և աճ գրանցել հնգամյա պլանի ընթացքում։",
        "image": "",
        "options": ["գյուղատնտեսություն", "սպառողական ապրանքներ", 
                    "ծանր արդյունաբերություն", "ռազմական արտադրություն"],
        "correct_answer": "ծանր արդյունաբերություն",
        "points": 1
    },
                {
        "question": "Նշված պաստառներից ո՞րը չի պատկանում գյուղատնտեսական թեմային:",
        "image": ["poster88_1931_gyuxatntesutyun.jpg", "poster84_1932_gyuxatntesutyun.jpg", 
                    "poster90_1945_gyuxatntesutyun.jpg", "poster94_1923_artadrutyun.jpg"],
        "options": ["Առաջին_պաստառը", "Երկրրորդ_պաստառը", 
                    "Երրորդ_պաստառը", "Չորրորդ_պաստառը"],
        "correct_answer": "Չորրորդ_պաստառը",
        "points": 1
    }
]

# Quiz function
def quizzes_polls_page():
    st.title("Վիկտորինաներ, հարցումներ")
    st.write("Բացահայտեք դարաշրջանը և ստուգեք ձեր գիտելիքները մեր ինտերակտիվ վիկտորինաների և հարցումների միջոցով:")
    
    total_points = 0

    # Iterate over quiz questions
    for i, question_data in enumerate(quiz_questions, start=1):
        st.subheader(f"Հարց {i}: {question_data['question']}")
        if 'image' in question_data and question_data['image'] != "":
            st.image(question_data["image"], width=150)
        selected_option = st.radio("Ընտրիր պատասխանը:", options=question_data['options'], index = None)

        # Check if user's answer is correct
        if selected_option == question_data['correct_answer']:
            st.success("Correct!")
            total_points += question_data['points']
        # else:
        #     st.error("Incorrect. Please try again.")

    st.write(f"Total Points: {total_points}")

# Sidebar navigation
page_options = {
    "Գլխավոր էջ": main_page,
    "Ժամանակացույց": schedule_page,
    "Ենթաթեմաներ": subtopics_page,
    "Պաստառների պատկերասրահ": poster_gallery_page,
    "Վիկտորինաներ և հարցումներ": quizzes_polls_page
}

selected_page = st.sidebar.selectbox("Ընտրեք էջը", list(page_options.keys()))


# Display selected page
page_options[selected_page]()

